{
  "backend/main.mo": "Main Motoko actor defining user profiles, investments across 24 categories, nominee management, and DigiLocker integration with access control and HTTP outcalls support.",
  "feature_evidence.json": "Feature evidence report documenting implementation of Aadhaar/PAN sidebar icons, inline input fields, automatic holdings fetching, and manual fetch button with high confidence.",
  "frontend-file-summaries.txt": "JSON summary of frontend files including App.tsx with sidebar authentication flow, query hooks for backend operations, dashboard with portfolio display, and investment/nominee management components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining earth tone palette variables for light and dark modes including emerald greens, warm golds, and neutral grays.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div mounting the React application titled 'Investment Portfolio Tracker'.",
  "frontend/src/App.tsx": "Main React app with TanStack Router, Internet Identity authentication, sidebar with Aadhaar/PAN inline inputs, profile setup dialog, and routes for dashboard, investments, and nominee management.",
  "frontend/src/components/AddInvestmentForm.tsx": "Form component for adding new investments with all 24 category options, folio number field, SEBI registration checkbox, and validation before submission.",
  "frontend/src/components/DeleteInvestmentDialog.tsx": "Alert dialog component for confirming investment deletion with loading state and error handling using React Query mutation.",
  "frontend/src/components/EditInvestmentForm.tsx": "Form component for editing an existing investment, loading investment data by index from URL params and submitting updates via useUpdateInvestment mutation. Includes fields for name, category, amounts, date, notes, SEBI registration, and folio number.",
  "frontend/src/components/InvestmentCard.tsx": "Card component displaying individual investment details with category icon, amounts, gain/loss indicators, and action buttons for edit and delete. Maps investment categories to icons and labels, and integrates DeleteInvestmentDialog.",
  "frontend/src/components/PortfolioSummary.tsx": "Dashboard component showing three summary cards: total invested, current value, and total gain/loss with percentage. Uses color-coded styling (green for gains, red for losses) and formatINR utility.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing the backend actor instance with authentication, creating actors based on Internet Identity state and initializing access control with admin token. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, clear, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profile management, DigiLocker integration (Aadhaar, PAN, SOA), and investment CRUD operations. All hooks use the actor from useActor and invalidate related queries on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom earth-tone color palette defined as CSS variables for light and dark modes. Includes primary emerald green, warm neutrals, gold accents, and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying investment portfolio with summary cards, investment list, and buttons to add investments, manage nominees, and fetch SoA/Demat holdings (requires Aadhaar and PAN).",
  "frontend/src/pages/NomineeManagement.tsx": "Nominee management page with form to add/update/remove nominee information including name, contact numbers, and principal ID with validation and delete confirmation dialog.",
  "frontend/src/utils/currency.ts": "Currency formatting utility that converts numbers to Indian Rupee format using lakhs and crores notation for large amounts (e.g., ₹5.25 L, ₹10.50 Cr).",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence and cleanup functions for sensitive data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), border radius, shadows, fonts, and animations for UI components with dark mode support.",
  "project_state.json": "Project state tracking document defining the Investment Holdings Fetcher application with feature requirements for Aadhaar/PAN card entry via sidebar icons, auto-fetch mechanism, and manual fetch button."
}