{
  "kind": "build_request",
  "title": "Add sidebar icons for Aadhaar/PAN entry with inline input fields and auto-fetch",
  "projectName": "Investment Holdings Fetcher",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add two separate icons to the sidebar: one for Aadhaar card entry and one for PAN card entry. Icons should be visually distinct and clearly labeled.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "these two different icons should appear in sidebar"
        ]
      },
      "acceptanceCriteria": [
        "Two icons appear in the application sidebar",
        "One icon is labeled for Aadhaar card entry",
        "One icon is labeled for PAN card entry",
        "Icons are visually distinct from each other"
      ]
    },
    {
      "id": "REQ-2",
      "text": "When either sidebar icon is clicked, display inline input fields for entering the respective card number (Aadhaar or PAN). The input fields should appear directly in the sidebar or adjacent area without navigating away from the current page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "show inline input fields"
        ]
      },
      "acceptanceCriteria": [
        "Clicking Aadhaar icon displays an inline input field for Aadhaar number",
        "Clicking PAN icon displays an inline input field for PAN number",
        "Input fields appear without page navigation or modal popups",
        "Input fields include appropriate validation and formatting"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement automatic fetching of investment holdings as soon as valid Aadhaar and PAN numbers are entered. The system should retrieve and display all Aadhaar and PAN linked holdings immediately without requiring additional user action.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "data fetching should be automatically fetching and display all the adhar and pan linked holdings immediately"
        ]
      },
      "acceptanceCriteria": [
        "Holdings are automatically fetched when both valid Aadhaar and PAN numbers are entered",
        "All linked investments are retrieved from the backend",
        "Holdings display immediately after successful fetch",
        "User receives feedback during the fetching process"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a manual fetch button that allows users to trigger the holdings retrieval on demand. This button should be available after Aadhaar and PAN numbers have been entered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "there should be fetch button"
        ]
      },
      "acceptanceCriteria": [
        "A fetch button is visible after Aadhaar and PAN numbers are entered",
        "Clicking the button triggers holdings retrieval",
        "Button shows loading state during fetch operation",
        "Button is disabled if required card numbers are missing"
      ]
    }
  ],
  "constraints": [
    "Maintain existing DigiLocker integration architecture in backend/main.mo",
    "Preserve earth-tone styling and OKLCH color system",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts",
    "Keep all backend logic in the single main actor file"
  ],
  "nonGoals": [
    "Redesigning the existing dashboard layout",
    "Modifying the 24 investment categories structure",
    "Changing authentication mechanisms",
    "Adding new investment types or fields"
  ],
  "imageRequirements": {
    "required": [
      "Aadhaar card icon illustration in earth-tone emerald green style (aadhaar-icon.dim_32x32.png)",
      "PAN card icon illustration in earth-tone warm gold style (pan-icon.dim_32x32.png)"
    ],
    "edits": []
  }
}